Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir.Direction
The direction of the RebarShapeSegment in UV-space.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir.#ctor(Autodesk.Revit.DB.UV)
Create a fixed segment direction constraint.
dir:
A fixed direction in UV-space.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
dir has zero length.
Since:
2012

Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir
A constraint that can be applied to a RebarShapeSegment and fixes the
direction of the segment in UV-space.
Since:
2012